# Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [2]:
data= 4, 8, 15, 16, 23, 42

In [1]:
import pandas as pd

In [3]:
df = pd.Series(data)

In [4]:
df

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [5]:
type(df)

pandas.core.series.Series

# Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [6]:
l = [1,2,3,4,5,6,7,8,9,10]

In [7]:
df1 = pd.Series(l)

In [8]:
df1

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

# Q3. Create a Pandas DataFrame that contains the following data:

In [18]:
info={'Name':['Alice','Bob','Claire'],'Age':[25,30,27],'Gender':['Female','Male','Female']}
info

{'Name': ['Alice', 'Bob', 'Claire'],
 'Age': [25, 30, 27],
 'Gender': ['Female', 'Male', 'Female']}

In [20]:
df2=pd.DataFrame(info)

In [24]:
df2

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

# Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

DataFrame is a two dimension data structures or a table a row or a coloumns where series panda series like a one dimensinal array like a column in a table holding any type of data

In [27]:
# ex ..     DataFrame 
student_data = {'Name':['Malaya','Afshan','Aamir','Adnan','Maryam'],'Age':[25,26,28,24,18],'School_Id':[22,33,44,55,66],'Father_name':['Ravi','Raza','Ishaq','Iqbal','Shaffeq']}

In [28]:
student_data

{'Name': ['Malaya', 'Afshan', 'Aamir', 'Adnan', 'Maryam'],
 'Age': [25, 26, 28, 24, 18],
 'School_Id': [22, 33, 44, 55, 66],
 'Father_name': ['Ravi', 'Raza', 'Ishaq', 'Iqbal', 'Shaffeq']}

In [30]:
df3 = pd.DataFrame(student_data)

In [31]:
df3

     Name  Age  School_Id Father_name
0  Malaya   25         22        Ravi
1  Afshan   26         33        Raza
2   Aamir   28         44       Ishaq
3   Adnan   24         55       Iqbal
4  Maryam   18         66     Shaffeq

In [34]:
type(df3)

pandas.core.frame.DataFrame

In [32]:
df3.columns

Index(['Name', 'Age', 'School_Id', 'Father_name'], dtype='object')

In [33]:
df3['Name']

0    Malaya
1    Afshan
2     Aamir
3     Adnan
4    Maryam
Name: Name, dtype: object

In [35]:
type(df3['Name'])

pandas.core.series.Series

# Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

In [36]:
#Some Common Functions Are.........

#Let Assume Data 
course = {'Mentor':['Sudhanshu Kumar ji','Krish Naik ji'],'Subjects':['Pythons and Big Data','Statics and ML'],'Timing':['self-paced','self-paced'],'Support':['10 am to 10 pm','10 am to 10 pm',]}

In [37]:

course

{'Mentor': ['Sudhanshu Kumar ji', 'Krish Naik ji'],
 'Subjects': ['Pythons and Big Data', 'Statics and ML'],
 'Timing': ['self-paced', 'self-paced'],
 'Support': ['10 am to 10 pm', '10 am to 10 pm']}

In [47]:
df_frame = pd.DataFrame(course)

In [48]:
df4

               Mentor              Subjects      Timing         Support
0  Sudhanshu Kumar ji  Pythons and Big Data  self-paced  10 am to 10 pm
1       Krish Naik ji        Statics and ML  self-paced  10 am to 10 pm

In [49]:
df_series = pd.Series(course)

In [50]:
df_series

Mentor         [Sudhanshu Kumar ji, Krish Naik ji]
Subjects    [Pythons and Big Data, Statics and ML]
Timing                    [self-paced, self-paced]
Support           [10 am to 10 pm, 10 am to 10 pm]
dtype: object

In [51]:
df_frame.columns

Index(['Mentor', 'Subjects', 'Timing', 'Support'], dtype='object')

In [53]:
df_frame['Mentor']

0    Sudhanshu Kumar ji
1         Krish Naik ji
Name: Mentor, dtype: object

In [54]:
df_frame['Subjects']

0    Pythons and Big Data
1          Statics and ML
Name: Subjects, dtype: object

In [57]:
type(df_frame['Subjects'])

pandas.core.series.Series

In [56]:
df_frame.dtypes

Mentor      object
Subjects    object
Timing      object
Support     object
dtype: object

In [59]:
df_frame[['Subjects']]

               Subjects
0  Pythons and Big Data
1        Statics and ML

In [60]:
type(df_frame[['Subjects']])

pandas.core.frame.DataFrame

In [61]:
# gives first 5 entry of the data
df_frame.head

<bound method NDFrame.head of                Mentor              Subjects      Timing         Support
0  Sudhanshu Kumar ji  Pythons and Big Data  self-paced  10 am to 10 pm
1       Krish Naik ji        Statics and ML  self-paced  10 am to 10 pm>

In [62]:
# gives last 5 entry  of the data 
df_frame.tail

<bound method NDFrame.tail of                Mentor              Subjects      Timing         Support
0  Sudhanshu Kumar ji  Pythons and Big Data  self-paced  10 am to 10 pm
1       Krish Naik ji        Statics and ML  self-paced  10 am to 10 pm>

# Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Series is a one-dimensional array with homogeneous data.  All the elements of series should be of same data type.
Key Features of a Series:
Homogeneous data
Size Immutable
Values of Data Mutable


DataFrame is a two-dimensional array with heterogeneous data, usually represented in the tabular format. The data is represented
in rows and columns. Each column represents an attribute and each row represents a person.
Key Features of a DataFrame:
Heterogeneous data
Size Mutable
Data Mutable


Panel is a three-dimensional data structure with heterogeneous data.

Key Features of a Panel:
Heterogeneous data
Size Mutable
Data Mutable

# Q7. Create a DataFrame using multiple Series. Explain with an example.

In [4]:
course = pd.Series(['Data Science','Machine Learning','Python','Computer Vision'])
fees = pd.Series([17700, 25500, 1500, 8790])
frame = {"Course's": course,"Fees":fees}

df7 = pd.DataFrame(frame)


#Adding a Series

discount = [7700,500,300,790]
df7['discount'] = pd.Series(discount)

In [5]:
df7

           Course's   Fees  discount
0      Data Science  17700      7700
1  Machine Learning  25500       500
2            Python   1500       300
3   Computer Vision   8790       790